ДИПЛОМНЕТОЛОГИЯ/src/Documents/ВКМ_НачислениеЗаработнойПлаты_Универсальный/ВКМ_НачислениеЗаработнойПлаты_Универсальный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗаработнойПлаты_Универсальный</name>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияНачало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияКонец</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодНачало</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БазовыйПериодКонец</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>График</name>
      <type>
        <types>CatalogRef.ВКМ_Графики</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ДИПЛОМНЕТОЛОГИЯ/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентЗаВыполненныеРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДИПЛОМНЕТОЛОГИЯ/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДИПЛОМНЕТОЛОГИЯ/src/Enums/ВКМ_КатегорияСотрудника/ВКМ_КатегорияСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорияСотрудника</name>
  <enumValues>
    <name>Специалист</name>
  </enumValues>
  <enumValues>
    <name>АдминистративныйПерсонал</name>
  </enumValues>
</mdclass:Enum>

ДИПЛОМНЕТОЛОГИЯ/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Больничный</name>
      <description>Больничный</description>
    </items>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
    <items>
      <name>Прогул</name>
      <description>Прогул</description>
    </items>
    <items>
      <name>ПроцентОтРабот</name>
      <description>Процент от выполненных работ</description>
    </items>
  </predefined>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.ВКМ_СпособРасчета</types>
    </type>
  </attributes>
</mdclass:ChartOfCalculationTypes>

ДИПЛОМНЕТОЛОГИЯ/src/Documents/ВКМ_НачислениеЗаработнойПлаты_Универсальный/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикСобытийФормы  

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
КонецПроцедуры

#КонецОбласти   


#Область ОбработчикСобытийЭлементовФормы 
&НаКлиенте
Процедура НачисленияВидРасчетаПриИзменении(Элемент)
	УстановитьСуммуПоПроценту();
КонецПроцедуры  

&НаКлиенте
Процедура НачисленияСотрудникПриИзменении(Элемент)
	УстановитьСуммуПоПроценту();
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПериодДействияНачалоПриИзменении(Элемент)
	УстановитьСуммуПоПроценту();
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПериодДействияКонецПриИзменении(Элемент)
	УстановитьСуммуПоПроценту();
КонецПроцедуры

#КонецОбласти 


#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Процедура УстановитьСуммуПоПроценту() 
	ТекДанные = Элементы.Начисления.ТекущиеДанные;     
	ТекДанные.Показатель = 0;
	Результат = ВидРасчета_Показатель_СуммаНачислений(ТекДанные.Сотрудник, ТекДанные.ВидРасчета, ТекДанные.ПериодДействияНачало); //Возвращает структуру: Показатель и Видрасчета (строка) и Сумма начислений 
	Если Результат.ВидРасчета = "Оклад" Тогда
		ТекДанные.СуммаКОплате = Результат.Сумма;  
	ИначеЕсли 
		Результат.ВидРасчета = "ПроцентОтРабот" Тогда 
		ТекДанные.СуммаКОплате =  ВычислитьПроцентЗаВыполненныеРаботы_И_НДФЛ(ТекДанные.Сотрудник, ТекДанные.ПериодДействияНачало, ТекДанные.ПериодДействияКонец, ТекДанные.ВидРасчета);	
		ТекДанные.Показатель = Результат.Показатель;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВидРасчета_Показатель_СуммаНачислений(Сотрудник, ВидРасчета, ПериодДействияНачало)  
	Результат = Новый Структура("Сумма, ВидРасчета, Показатель");
	Если ЗначениеЗаполнено(Сотрудник) И ЗначениеЗаполнено(ВидРасчета) Тогда 
		СотрудникОбъект = Сотрудник.ПолучитьОбъект();
		Сумма = 0;  
		Отбор = Новый структура("Сотрудник", Сотрудник);
		Если ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда 
			Результат.ВидРасчета = "Оклад";
			Попытка
				Сумма = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(ПериодДействияНачало, Отбор)[0].Оклад;
			Исключение ОбщегоНазначения.СообщитьПользователю("У сотрудника "+ Сотрудник +" не установлен оклад на дату ""Период действия начало"" "); 
			КонецПопытки;
		ИначеЕсли ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПроцентОтРабот И СотрудникОбъект.Категория = Перечисления.ВКМ_КатегорияСотрудника.Специалист Тогда 
			Результат.ВидРасчета = "ПроцентОтРабот";
			Попытка
				Результат.Показатель = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(ПериодДействияНачало, Отбор)[0].ПроцентЗаВыполненныеРаботы;   
			Исключение ОбщегоНазначения.СообщитьПользователю("У сотрудника "+ Сотрудник +" не установлен процент за выполеннные работы на дату ""периода действия начало"""); 
			КонецПопытки;
		КонецЕсли; 
	КонецЕсли;
	Результат.Сумма = Сумма;
	Возврат Результат; 
КонецФункции 

Функция ВычислитьПроцентЗаВыполненныеРаботы_И_НДФЛ(Сотрудник, ПериодНачало, ПериодКонец, ВидРасчета)
	Если ЗначениеЗаполнено(Сотрудник)
		И ЗначениеЗаполнено(ПериодНачало) 
		И ЗначениеЗаполнено(ПериодКонец) 
		И ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПроцентОтРабот тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник КАК Сотрудник,
		|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот КАК СуммаНачислений
		|ИЗ
		|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(
		|			&ПериодНачало,
		|			&ПериодКонец,
		|			,
		|			Сотрудник = &Сотрудник
		|				И Сотрудник.Категория = &Категория) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты";
		Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
		Запрос.УстановитьПараметр("ПериодНачало",ПериодНачало);
		Запрос.УстановитьПараметр("ПериодКонец",ПериодКонец); 
		Запрос.УстановитьПараметр("Категория",Перечисления.ВКМ_КатегорияСотрудника.Специалист);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();  
		
		Если Не ЗначениеЗаполнено(Выборка.СуммаНачислений) Тогда
			Возврат 0;
		КонецЕсли; 
		
		СуммаКОплате = Выборка.СуммаНачислений; 
		
		Возврат СуммаКОплате;
	Иначе 
		Возврат 0;
	КонецЕсли;
КонецФункции

#КонецОбласти
